Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/legal_matters_and_health/consent_to_medical_and_surgical_procedures.html.txt.tmx
Source language: en
Languages: ga

source: Consent to medical and surgical procedures
ga: Toiliú don chóireáil leighis agus máinliach

source: As a general rule, medical or surgical procedures may not be carried out without the informed consent of the patient
ga: Mar riail ginearálta, ní féidir cóireáil leighis ná máinliach a chur ar dhuine gan toiliú eolasach a fháil ón othar féin

source: The Assisted Decision-Making (Capacity) Act 2015 provides laws to support decision-making by adults who have difficulty in making decisions without help
ga: Níl an dlí soiléir céard ba cheart tarlú sa chás nach féidir leis an othar toiliú, mar shampla, má tá easláinte intinne i gceist nó má tá sé/sí gan aithne gan urlabhra

source: The Act was signed into law on 30 December 2015 but has not yet been commenced to bring it into effect. Read more about the Act (pdf)
ga: Chomh maith leis sin, níl sé iomlán soiléir cén toiliú go díreach atá ag teastáil i gcás leanaí

source: Until the Act is commenced, the law is not clear on what should happen in cases where the patient is unable to give consent because, for example, of a mental disorder or because he/she is comatose
ga: Tá mionrialacha ann maidir le hiompar tástálacha cliniciúla agus an t-eolas nach mór a thabhairt do rannpháirtithe na dtástálacha seo

source: In general, valid consent must be informed consent where the patient has sufficient information to be able to understand the nature of what is proposed and the potential risks and benefits involved
ga: Go ginearálta, is ionann toiliú bailí agus toiliú eolasach. Níl an dlí soiléir ar cé mhéid eolais nach mór do dhochtúir a thabhairt d'othar

source: The patient must have the capacity to make the decision and must be free to do so without threat or pressure from others
ga: Tá an toiliú leagtha síos sa dlí anois maidir le cóireáil síciatrach ach níl i gcás aon chóireála eile

source: If there is no consent
ga: Nuair nach bhfuil aon toiliú ann

source: If a person carries out medical or surgical procedures without consent, he/she could be charged with the crime of assault - the decision on charges is made by the Director of Public Prosecutions
ga: Má chuireann duine cóireáil leighs ná máinliach ar dhuine gan toiliú a fháil, d'fhéadfaí é/í a chúisiú as coir an ionsaithe - is é/í Stiúrthóir na nIonchúiseamh Poiblí a dhéanann an cinneadh duine a chúisiú

source: He/she could also be sued for the tort (civil wrong) of trespass to the person and possibly for breach of constitutional rights
ga: D'fhéadfaí an dlí a chur air/uirthi as tort (éagóir shibhialta) na foghla ar dhuine agus b'fhéidir as cearta bunreachtúla an duine a shárú

source: If the person involved is a medical professional, he/she could also be sued for negligence
ga: Más duine gairmiúil den lucht leighis atá i gceist, d'fhéadfaí an dlí a chur air/uirthi as faillí a bheith déanta

source: The patient may take these actions
ga: Is féidir leis an othar na himeachtaí seo a thógáil

source: If you are a mentally competent adult, there is no doubt about the need for consent but what exactly constitutes informed consent is not totally clear
ga: Más duine fásta inniúil de mheabhair thú níl aon dabht ach go dteastaíonn toiliú uait ach níl sé soiléir céard go díreach é an toiliú eolasach

source: You may give a general consent – for example, you may tell your doctor to do what he/she considers best
ga: B'fhéidir go mbeadh toiliú ginearálta tugtha agat - mar shampla, b'fhéidir go mbeadh sé ráite agat le do dhochtúir déanamh mar a chreideann sé/sí féin a bheith ceart

source: You may give implied consent by not specifically ruling out certain procedures
ga: D'fhéadfadh sé go mbeadh toiliú intuigthe tugtha agat ós rud é nár luaigh tú cóireáil faoi leith nár theastaigh uait toiliú lena aghaidh

source: Your implied consent may arise out of necessity – for example, if unexpected complications arise during an operation
ga: B'fhéidir go dtiocfadh do thoiliú intuighte i gceist de bharr riachtanais - mar shampla, má thagann deacrachtaí aníos nach raibh aon súil leo i rith obráide

source: If you are seriously ill and not in a position to give or withhold consent, the doctor may carry out what would be considered usual procedures arising from necessity
ga: Má tá tú go dona tinn agus muna bhfuil tú in ann toiliú a thabhairt nó a dhiúltú, d'fhéadfadh an dochtúir an chóireáil a bheadh tugtha de ghnáth a chur ort de bharr riachtanais

source: Sometimes doctors may consult with your family or nearest relatives but they really have no legal right to give or withhold consent
ga: B'fhéidir go rachadh na dochtúirí i gcomhairle le do theaghlach nó le do neasghaol ach i ndáiríre níl aon cheart dlíthiúil acu toiliú don chóireáil nó diúltú dí

source: Refusal of medical treatment
ga: Diúltú don chóireáil leighis

source: It is clear that, if you are a mentally competent adult, you have the right to refuse or discontinue medical treatment even if the inevitable consequence is that you will die
ga: Má tá sé soiléir gur duine fásta inniúil de mheabhair thú, tá sé de cheart agat diúltú don chóireáil leighis nó deireadh a chur leis fiú más rud é go mbeadh an bás mar thoradh ar an gcinneadh sin

source: This is different from taking positive measures to end your own life or another person's life
ga: Ní ionann seo agus céimeanna dearfacha a thógáil lámh a chur i do bhás féin nó i mbás duine eile

source: If you are not mentally competent, you are not in a position to make a decision about refusing or discontinuing medical treatment
ga: Muna bhfuil tú inniúil de mheabhair, ní féidir leat cinneadh a dhéanamh diúltú don chóireáil nó deireadh a chur léi

source: The law is not clear on exactly who is competent to do this
ga: Níl an dlí iomlán soiléir ar cé go díreach atá inniúil é seo a dhéanamh

source: In general, a medical professional may make decisions that the treatment should be discontinued for medical reasons
ga: Go ginearálta, is féidir le duine gairmiúil leighis cinneadh a dhéanamh gur ceart deireadh a chur leis an gcóireáil ar chúiseanna leighis

source: In some countries, Advance Healthcare Directives may be considered legally valid but there has been no ruling on this in Ireland
ga: I dtíortha éagsúla, glactar go bhfuil "uachtanna beo" dlíthiúil agus bailí ach níl aon rialú déanta in Éirinn ar seo

source: An Advance Healthcare Directive is a document in which a person sets out their wishes about the continuation or otherwise of medical treatment if they should become mentally incapable
ga: Is cáipéis í "Uacht bheo" ina leagann duine síos céard a bheadh ag teastáil uaidh/uaithi maidir le cóireáil leighis a fháil agus leanacht leis sa chás nach raibh sé/sí inniúil de mheabhair an cinneadh a dhéanamh

source: The Act also provides laws for Advance Healthcare Directives
ga: Ní coir é an féinmharú féin ná iarracht a dhéanamh tú féin a mharú

source: The Act was signed into law on 30 December 2015 but has not yet been commenced to bring it into effect
ga: Ach, is coir choiriúil í cúnamh a thabhairt do dhuine eile céimeanna a thógáil le deireadh a chur lena s(h)aol féin

source: An enduring power of attorney does not give the attorney the power to make decisions of this nature on behalf of the person granting the power
ga: D'fhéadfaí an chúis seo a bheith i gceist is cuma más duine proifisiúnta den lucht leighis é/í an cúntóir nó nach ea

source: It is the practice for doctors and other medical professionals to get the consent of parents or guardians for medical and surgical procedures to be carried out on minors
ga: Lorgaíonn dochtúirí agus lucht proifisiúnta leighis eile toiliú tuismitheoirí nó caomhnóirí má tá cóireáil leighis nó máinliach le cur ar dhaoine óga. Níl an dlí soiléir faoin ábhar seo ach is cosúil go bhfuil glactha leis go dteastaíonn toiliú tuismitheoirí

source: The Supreme Court has held that a health board (now replaced by the Health Service Executive) did not have the right to insist on having a test carried out on a child without parental permission
ga: Bhí cás ós comhair na Cúirte Uachtaraí le deireanas a leag síos nach bhfuil sé de cheart ag bord sláinte an tástáil sáile a dhéanamh ar pháiste gan toiliú na dtuismitheoirí

source: This case involved the PKU or heel pin-prick test, which is usually carried out on babies shortly after birth
ga: Bhain an cás seo leis an tástáil sáile nó feinilcéatónúire (PKU) a dhéantar go hiondúil ar leanaí go gairid tar éis a mbreithe

source: The Supreme Court held that only in exceptional circumstances would the court intervene and make an order contrary to the wishes of the parents
ga: Is cosúil go mbeadh an Chúirt sásta leas an linbh a chur san áireamh agus b’fhéidir cearta an linbh a chur roimh cearta na dtuismitheoirí

source: Section 23 of the Non-Fatal Offences Against the Person Act, 1997 provides that young people of 16 and over may give valid consent to medical, surgical and dental treatment
ga: Faoi Alt 23 d'Acht um Chionta Neamh-Mharfacha i Aghaidh an Duine 1997 is féidir le daoine óga de 16 bliain d'aois agus ós a chionn toiliú bailí a thabhairt do chóireáil leighis, máinliach agus fiaclóireachta

source: Consent to psychiatric treatment
ga: Toiliú don chóireáil síciatrach

source: There are specific laws about consent in relation to the rights of psychiatric patients
ga: Ar mhaithe leis seo, is ionann toiliú agus toiliú scríofa, faighte gan bhac, gan aon bhagairt ná mealladh:

source: The National Consent Policy applies to services provided by or on behalf of the Health Service Executive (HSE)
ga: Leagann an tAcht síos na rialacha a bhaineann le toiliú na rannpháirtithe a fháil do thástálacha cliniciúla

source: The National Consent Policy and guides are available for download
ga: • tú in ann nádúr, brí agus scóip an toilithe a thuiscint agus

source: These include guides for patients, professionals and young people
ga: Tá sé de chead agat do thoiliú a tharraingt siar ag am ar bith
